Revit 2026 API

# ElementId Property

---

A unique identifier for an Element in an Autodesk Revit project.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId Id { get; }
```
```vb
Public ReadOnly Property Id As ElementId
	Get
```
```cpp
public:
property ElementId^ Id {
	ElementId^ get ();
}
```
```fsharp
member Id : ElementId with get
```

#### Property Value

ElementId

Returns an object containing the project-wide unique identifier for this Element. The identifier with this id is only unique for the project, it is not unique across separate Autodesk Revit projects.

#### Reference

Element Class

Autodesk.Revit.DB Namespace